БИТУправление_медицинским_центром_демо/src/Documents/СписаниеБонусов/СписаниеБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБонусов</name>
  <registerRecords>AccumulationRegister.НакопленияПоСкидкам</registerRecords>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСгорания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРаботыСБонусами</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийРаботыСБонусами/ВидыОперацийРаботыСБонусами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРаботыСБонусами</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/СписаниеБонусов/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("ВидОперации");
	Поля.Добавить("СозданАвтоматически");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

// Процедура формирует представление документа вида <ТИП> № <Номер> от <Дата>
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ВидОперации = Перечисления.ВидыОперацийРаботыСБонусами.Начисление Тогда
		Представление = НСтр("ru='Пополнение бонусов'");
		
	ИначеЕсли Данные.СозданАвтоматически Тогда
		Представление = НСтр("ru='Сгорание бонусов'");
		
	Иначе
		Представление = НСтр("ru='Списание бонусов'");
	КонецЕсли;
	
	Представление = Представление + " № " + Данные.Номер+ " от " + Данные.Дата;
	
КонецПроцедуры

#КонецОбласти
